MyBlog/app/views/films/show.html.erb

<h4>  <%= t("Articles about this film") %></h4>
<% @film.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "links" ON "posts"."id" = "links"."post_id" WHERE "links"."film_id" = ?  [["film_id", 1]]