MyBlog/app/controllers/films_controller.rb

  def index
    @film=Film.all
---
SELECT "films".* FROM "films"

  def edit
    @film=Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def show
    @film=Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @film=Film.new(film_params)
    if(@film.save)
---
INSERT INTO "films" ("name", "year", "director", "discription", "actors", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @film=Film.find(params[:id])
    @film.destroy
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 3]]

  def update
    @film=Film.find(params[:id])
    if(@film.update(film_params))
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "films" SET "name" = ?, "director" = ?, "year" = ?, "actors" = ?, "discription" = ?, "updated_at" = ? WHERE "films"."id" = ?