MyBlog/app/controllers/posts_controller.rb

  def create
    movies=params[:val]
    movies=movies.split("|")
    @post=Post.new(post_params)
    movies.size.times do |i|
      @film=Film.find_by_name(movies[i])
      @post.films << @film
---
SELECT  "films".* FROM "films" WHERE "films"."name" = ? LIMIT ?  [["name", "Blade Runner 2049"], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New article of mine"], ["body", "Text of my new article which is extrodinary"], ["created_at", "2019-12-06 18:38:38.386795"], ["updated_at", "2019-12-06 18:38:38.386795"]]

  def update
    @post=Post.find(params[:id])
    if(@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First article of mine"], ["body", "Text of my first article which is extrodinary"], ["updated_at", "2019-12-06 19:46:24.339305"], ["id", 1]]