MyBlog/app/views/posts/show.html.erb

<h4><%= t("Films related to the article") %></h4>
<% @post.films.each do |film| %>
---
SELECT "films".* FROM "films" INNER JOIN "links" ON "films"."id" = "links"."film_id" WHERE "links"."post_id" = ?  [["post_id", 4]]